export default {
  'T-7之前': [
    '各板块建立投产窗口，指定投产窗口联系人;',
    '牵头板块建立投产大窗口。'
  ],
  'T-7': [
    '各版块推进任务进行投产窗口挂载及release分支合并(公共内容挂载在牵头板块);',
    '如需提交测试中心整包测试重点，请在任务UAT阶段填写提测重点;',
    '各版块确认上线确认书是否已到达，并及时打开任务“上线确认书”按钮;',
    '各版块进行投产内容评审，投产牵头人牵头进行公共部分内容评审，注意内外部关联系统并及时通知信息;',
    '投产牵头人反馈测试中心基本投产信息。'
  ],
  'T-6': [
    '各板块推进任务的release分支合并，投产牵头人统计投产清单上面已经完成release分支合并的任务提交整包测试。'
  ],
  'T-5': [
    '各版块推进任务的release分支合并，投产牵头人统计投产清单上面已经完成release分支合并的任务提交整包测试;',
    '各版块及时填写灰度和生产发布说明;',
    '各版块解决整包测试问题。'
  ],
  'T-4': [
    '各版块投产负责人及时整理任务维度和窗口维度的投产材料，提交t日的日常类型的生产变更单;',
    '各版块进行灰度发布说明评审，投产牵头人进行总的灰度发布说明评审;',
    '各版块推进任务的master分支合并，投产牵头人统计投产清单上面已经完成master分支合并的任务提交准生产测试',
    '各版块推进自己板块的源代码扫描进度(红线扫描进度);',
    '各版块解决整包测试问题。'
  ],
  'T-3': [
    '各版块及时推进任务的master分支合并;',
    '各版块及时准备并放置好测试中心版本;',
    '各版块进行灰度变更单的提交(灰度变更前2小时完成介质交付);',
    '各版块进行灰度介质的准备和提交;',
    '各版块解决准生产测试问题。'
  ],
  'T-2': [
    '各版块进行灰度组织进行灰度变更及验证;',
    '各版块进行生产发布说明评审，投产牵头人进行总的生产发布说明评审;',
    '各版块解决准生产测试问题。'
  ],
  'T-1': [
    '各版块组织进行灰度重发及验证;',
    '各版块进行生产变更单准备(t-1的17点前交付)。'
  ],
  T: ['各版块当晚组织变更并及时反馈验证结果。']
};
