<template>
  <div class="page-container">
    <pre>
<h6>玉衡功能使用说明</h6>
1、工单提测
    路径：fdev提测
    说明：开发人员在fdev点击【提交测试按钮】发相关工单人员通知弹窗，并在玉衡工单-提测信息中查看
    角色: 开发人员

2、提测工单信息查看
    路径：玉衡工单-提测信息
    说明：查看提交内测需求的详细信息，点击工单可查看提测信息详情页面
    角色: 内测人员

3、提测文档查看
    路径：玉衡工单-我的工单-工单详情
    说明：工单详情可查看任务相关文档
    角色: 行内人员、开发人员、内测人员

4、提测工单打回功能
    路径：玉衡工单-我的工单
    说明：提测不规范的工单可通过该功能进行工单的打回到开发阶段
    角色: 内测人员

5、工单分配
    路径：玉衡工单-我的工单
    说明：工单被分配给测试人员后，发测试人员通知弹窗
    角色: 内测组长

6、工单进入下一阶段条件
    路径：玉衡工单-我的工单
    说明：进入uat、分包测试、投产需将所有案例执行成功
    角色: 内测人员

7、工单状态变更通知
    路径：玉衡工单-我的工单
    说明：1、玉衡上工单，由【开发中】状态改为【SIT】状态，发fdev任务相关人员通知弹窗
    角色: 行内人员、开发人员、内测人员

8.案例评审
    路径：玉衡工单-我的工单-执行计划-发送案例评审
    说明：完成案例编写后，发送邮件给相关老师评审
    角色: 行内人员、开发人员、内测人员

9、案例执行
    路径：玉衡工单-我的工单-执行计划
    说明：1、案例执行除失败操作外，会自动跳转下一条。2、新增案例排序功能
    角色: 内测人员

10、提交缺陷及缺陷修改发送通知给缺陷相关人员
    路径：玉衡工单-我的工单-执行计划-操作-执行
    说明：玉衡自动发送邮件到缺陷提交人员、开发和工单负责人
    角色: 行内人员、开发人员、内测人员

11、sit测试报告
    路径：玉衡工单-sit测试报告-操作-打印
    说明：玉衡点击打印生成sit测试报告，发工单相关人员通知弹窗，手工发送邮件给相关干系人
    角色: 行内人员、开发人员、内测人员

12、提交业测
    路径：玉衡工单-sit测试报告-操作-提交业测
    说明：搜索出需要提交业测的的需求,点击操作列下,提交业测按钮,则自动发出提交业测的邮件
    角色: 行内人员、开发人员、内测人员

13、测试日报
    路径：玉衡监控-人员维度报表，日报报表
    说明：日报报表，人员维度：查看小组和个人的测试日报
    角色: 行内人员、开发人员、内测人员

14、测试周报
    路径：玉衡监控-缺陷维度
    说明：监控-缺陷维度查看周报内容
    角色: 行内人员、开发人员、内测人员

15、系统测试报告
    路径: fdev投产管理-投产窗口列表- 投产窗口名称-点击列表详情-生产投产材料-系统测试报告
    说明: 自动生产投产材料中系统测试报告
    角色: 投产负责人


    </pre>
  </div>
</template>

<script>
export default {
  name: 'About',

  data() {
    return {};
  }
};
</script>

<style scoped>
.page-container {
  padding-top: 40px;
}
</style>
